def detect_intent(message: str) -> str:
    text = message.lower().strip()

    keywords_rag = [
        "боомт", "хил", "орсон", "гарсан", "нэвтэрсэн",
        "зорчигч", "зорчсон", "жуулчин", "жуулчид", "иргэншил", "улсаар", "улс",
        "аялал", "аялал жуулчлал", "tourism", "tourist",
        "тээвэр", "тээврийн", "зам", "автотээвэр", "төмөр зам", "агаарын",
        "агаар", "нислэг", "нисэх", "road", "rail", "transport",
        "ачаа", "карго", "cargo", "экспорт", "импорт", "дамжин", "дотоод",
        "тайлан", "статистик", "салбар", "мэдээ",
        "эрчим хүч", "цахилгаан", "дулаан", "үйлдвэрлэл", "станц", "дцс",
        "уцс", "сцс", "нцс", "сэргээгдэх", "энерги", "energy", "power",
    ]

    if any(keyword in text for keyword in keywords_rag):
        return "rag"

    return "sql"